Revit 2024 API
BuiltInFailures.FamilyFailures Class
 Failures related to families.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class FamilyFailures
Visual Basic
Public NotInheritable Class FamilyFailures
Visual C++
public ref class FamilyFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.FamilyFailures
See Also
BuiltInFailures.FamilyFailures Members
Autodesk.Revit.DB Namespace